<%@ page language="java" contentType="text/html; charset=UTF-8"
    pageEncoding="UTF-8"%>
<ul class="pub-paper-list">
	<li>정필수, 허준행, 안휘, 강성원, 권오인, 서만수, 사용 시나리오 분석을 위한 부분 실행 아키텍처의 도출
		방법, 제 17회 한국 소프트웨어공학 학술대회(KCSE 20015), 2015년 1월 28일 ~ 30일.</li>
	<li>고경민, 강성원, 안종선, 소프트웨어 제품라인 개발을 위한 직교적 가변성 기술 언어 기반의 바인딩 적용
		도구, 제 17회 한국 소프트웨어공학 학술대회(KCSE 20015), 2015년 1월 28일 ~ 30일.</li>
	<li>김강현, 강성원, 김진규, 스마트폰을 이용하여 마이컴의 펌웨어를 업데이트하는 시스템 아키텍처 설계, 제
		17회 한국 소프트웨어공학 학술대회(KCSE 20015), 2015년 1월 28일 ~ 30일.</li>
	<li>이경종, 강성원, 이선아, 임베디드 소프트웨어 모듈의 이식성을 개선하기 위한 리팩토링 프로세스, 제 17회
		한국 소프트웨어공학 학술대회(KCSE 20015), 2015년 1월 28일 ~ 30일.</li>
	<li>신호승, 강성원, 이지현, 확장형 실시간 데이터 파이프라인 시스템 아키텍처 설계, 제 17회 한국
		소프트웨어공학 학술대회(KCSE 20015), 2015년 1월 28일 ~ 30일. (Abstract) [우수논문]</li>
	<li>정필수, 안종선, 박태현, 강성원, 소프트웨어 모듈성을 정량적으로 측정하는 방법, 제 16회 한국
		소프트웨어공학 학술대회(KCSE 20014), 2014년 2월 12일 ~ 14일. (Abstract) [우수논문]</li>
	<li>한승범, 이선아, 강성원, 파일 오너십에 따른 코드 품질 수준에 대한 사례 연구, 제 16회 한국
		소프트웨어공학 학술대회(KCSE 20014), 2014년 2월 12일 ~ 14일.</li>
	<li>이희진, 강성원, 모바일 소프트웨어 에코시스템(MSECO)의 마켓을 위한 단말 중심 어플리케이션 필터링
		방법, 제 16회 한국 소프트웨어공학 학술대회(KCSE 20014), 2014년 2월 12일 ~ 14일.</li>
	<li>김진규, 강성원, 한영훈, 메시지 변환을 위한 메시지 필드 매핑 관계 식별 자동화 방법, 제 15회 한국
		소프트웨어공학 학술대회(KCSE 20013), 2013년 1월 30일 ~ 2월 1일.</li>
	<li>엄석환, 김진규, 강성원, 이민광, 김태호, 김진혁, MDD 기반의 임베디드 소프트웨어 재구조화 , 2011
		한국 소프트웨어공학 학술대회(KCSE 2011), 2011년 2월 9일 ~ 11일.</li>
	<li>안휘, 강성원, 휘처 모델을 위한 가변성 표현 방법의 비교, 2010 한국 소프트웨어공학
		학술대회(KSEJW2010), 2010년 8월 20일 ~ 21일.</li>
	<li>강성주, 안휘, 강성원, 신영미, 김상기, 소프트웨어 프로덕트 라인 가변성 표현 언어의 비교, 2010 한국
		소프트웨어공학 학술대회(KCSE 2010), 2010년 2월 8일 ~ 10일.</li>
	<li>김진규, 강성원, 이우진, 안휘, 이지현, 김명철, 임원기, 이노복, 전술 정보 교환을 위한 VMF와
		Link-16 메시지 간의 변환 기술, 2009 한국소프트웨어공학기술 합동워크샵 프로그램, 제주 오리엔탈 호텔,
		2009.07.23 ~ 25.</li>
	<li>안휘, 강성원, A Comparison of Software Product Line Architecture
		Design Methods from the Practicality Viewpoint, 2009 한국 소프트웨어공학
		학술대회(KCSE 2009), 2009년 2월 9일 ~ 11일.</li>
	<li>김정호, 강성원, 사례연구: 기능확장성을 위한 소프트웨어 아키텍처 재설계, 2009 한국 소프트웨어공학
		학술대회(KCSE 2009), 2009년 2월 9일 ~ 11일.</li>
	<li>고경민, 윤준호, 유현재, 이지현, 강성원, 김명철, 임원기, 전술데이터링크 시스템 구축을 위한
		가변포맷메시지 시험도구 개발, 2008 한국소프트웨어공학 학술대회(KCSE 2008), 2.20~21, 2008.</li>
	<li>김정호, 강성원, 소프트웨어 아키텍처를 통한 시스템 기능확장성 측정에 관한 연구 한국IT서비스학회
		추계학술대회, 2007.11.21.</li>
	<li>윤은채, 강성원, A Framework for Exchanging Heterogeneous Messages
		based-on Ontology Mapping, 2007 한국 소프트웨어공학 학술대회, 2007년 2월 22일 ~ 24일.
	</li>
	<li>윤은채, 이지현, 강성원, 이노복, 가변 포맷 메시지로부터 XML 포맷 메시지로의 변환 기술, 한국통신학회
		추계종합학술발표회, 2006.11.18.</li>
	<li>김진규, 이지현, 강성원, 효율적인 파싱을 위한 형식화한 가변 포맷 메시지, 2006년도 한국통신학회
		추계학술대회, 2006.11.18.</li>
	<li>김정호, 강성원, FSP Model을 이용한 C&amp;C View 아키텍처의 검증 한국IT서비스학회 추계학술대회,
		2006.11.15.</li>
	<li>조수란, 강성원, 소프트웨어 설계 툴의 코드자동생성능력 비교 연구, 정보과학회 2006 가을 학술발표논문집
		제33권 제 2호 (C), 2006.10.20~21.</li>
	<li>박대성, 강성원, 소프트웨어 분석 체계 , 한국정보과학회 31회 춘계 발표회, 2004.4.</li>
	<li>최윤석, 강성원, ALFReD: 재귀적 설계를 위한 구조기술언어(ALFReD: Architecture
		description Language for Recursive Design), 제 6회 한국 소프트웨어공학 학술대회,
		2004년 2월 19일 ~ 21일.</li>
</ul>