<%@ page language="java" contentType="text/html; charset=UTF-8"
    pageEncoding="UTF-8"%>
<ul class="pub-paper-list">

	<li>신호승, 강성원, 이지현, 확장형 실시간 데이터 파이프라인 시스템 아키텍처 설계, 한국정보과학회 논문지 제42권 제8호, pp. 1010-1021, 2015년 8월.</li>
	<li>김정민, 강성원, 이지현, 문제틀과 아키텍처 패턴의 매칭을 이용한 소프트웨어 아키텍처 설계방법, 한국정보과학회 논문지 제42권 제3호, pp. 341-360, 2015년 3월.</li>
	<li>백하은, 강성원, 이지현, 조합 시험 설계를 이용한 소프트웨어 제품라인 시험항목 생성 방법, 한국정보과학회논문지 제31권 제10호, pp. 86-93, 2014년 10월.</li>
	<li>이지현, 강성원, 소프트웨어 프로덕트라인 가변성 기술 기법: OVDL, 한국정보처리학회 논문지 - 소프트웨어
		및 데이터 공학 - 제2권 제11호, pp. 739-746, 2013년 11월.</li>
	<li>이선아, 강성원, 소프트웨어 진화 작업을 위한 데이터 마이닝 기반 추천 시스템, 한국정보과학회지 제31권
		제10호, pp. 86-93, 2013년 10월.</li>
	<li>정필수, 안종선, 박태현, 강성원, 은나래, 고상원, 소프트웨어 모듈성을 정량적으로 측정하는 방법,
		한국정보과학회 소프트웨어공학 소사이어티 논문지, 제26권 제 3호, pp. 63 - 76, 2013년 9월.</li>
	<li>박태현, 안휘, 강성원, 박종빈, 황상철, 아키텍처 변환 패턴을 이용한 소프트웨어 시스템 진화 프레임워크,
		한국정보과학회 소프트웨어공학 소사이어티 논문지, 제26권 제 1호, pp. 17 - 29, 2013년 3월.</li>
	<li>김진규, 강성원, 정필수, 김정민, 백하은, 권구형, 김상수, 가변 길이 정보 메시지 최적화 방법,
		한국정보과학회 소프트웨어공학 소사이어티 논문지, 제26권 제 1호, pp. 1 - 16, 2013년 3월.</li>
	<li>백하은, 강성원, 김진규, 김정민, 권구형, 김상수, ASN.1을 이용한 가변 길이 메시지 표현 방법,
		한국정보과학회지 제 25권 제 2호, pp. 35-47, 2012년 6월.</li>
	<li>엄석환, 김진규, 강성원, 강성주, 김희강, 김경일, 모바일하버 통합 제어 시스템의 소프트웨어 아키텍처
		설계, 한국정보과학회 소프트웨어공학 소사이어티 논문지, 제23권 제 4호, pp. 125 - 139, 2011년 12월.
	</li>
	<li>김진현, 강인혜, 김평수, 강성원, 프로세스 알제브라를 이용한 AUTOSAR 소프트웨어 행위의 시간 특성
		검증 기법, 한국정보과학회 논문지, 소프트웨어 및 응용, 제38권 제11호, pp. 633-645, 2011년 11월.
		(2012 정보과학회 우수논문상)</li>
	<li>강성원, 카네기멜론 대학교 전산학대학 - 과학, 공학과 예술이 전산학을 만나는 곳, 한국정보과학회지 제29권
		제3호, pp. 86-93, 2011년 3월.</li>
	<li>강성원, 소프트웨어 아키텍처 설계의 근본 원리들, 한국정보과학회 소프트웨어공학 소사이어티 논문지, 제23권
		제 4호, pp. 125 - 139, 2010년</li>
	<li>강성원, 소프트웨어 모델링 언어를 소프트웨어 패밀리의 모델링언어로 확장하는 방법, 한국정보과학회
		소프트웨어공학소사이어티 논문지, 제23권 제 2호, 2010년 6월.</li>
	<li>강성원, 고인영, 백종문, 최호진, 이단형, 소프트웨어공학 글로벌 리더 양성과정 - KAIST-CMU
		소프트웨어공학 석사 프로그램, 한국정보과학회, 정보과학회지 제28권 제11호, pp. 86-93, 2010년 11월.</li>
	<li>강성원, David Garlan, 아키텍처 기반의 결정적 소프트웨어 진화계획의 가치 평가 , 한국
		정보처리학회 논문지 D 제16-D권 제5호, 2009년 10월.</li>
	<li>강성원, 이단형, 안유환, 수직적 추상의 도입에 의한 BPMN 추상기능의 확장, 정보처리학회 논문지 D
		제16-D권 제2호, 2009년 4월.</li>
	<li>안휘, 강성원, 김진규, 도메인 뷰포인트를 통한 소프트웨어 프로덕트 라인 아키텍처 설계방법들의 비교,
		소프트웨어공학소사이어티 논문지, Vol. 21, No. 4, 2008년 12월.</li>
	<li>강성원, 이단형, 이지현, 임홍순, 안유환, 비즈니스 프로세스에서의 가치달성도 측정, 정보처리학회논문지 D
		제15-D권 제3호, 2008년 6월.</li>
	<li>박형일, 강성원, 최윤석, 이단형, C&amp;C 아키텍처 기반의 객체지향 설계, 정보과학회논문지: 소프트웨어 및
		응용, 제34권 제4호, pp. 317~327, 2007년 4월.</li>
	<li>이지현, 강성원, 조진희, 김진삼, CBAM과 AHP를 이용한 소프트웨어 아키텍처 비용 평가,
		정보처리학회논문지 D 제 13-D권 제 5호 2006.10.</li>
	<li>강성원, 장웅, 박용범, 상호운용성 시험기술의 이론과 실제, 전자공학회지 제 3권 7호, 2004.7.</li>
	<li>강성원, 신재휘, 성종진, 홍경표, 소프트웨어 상호운영성 시험 체계와 방법론, 정보과학회논문지: 소프트웨어
		및 응용 4월호, 제31권 제4호, pp.394 ~ 402, 2004년 4월.</li>
	<li>강성원, 한동수, 소프트웨어 개발 전문가 양성 프로그램, 한국정보과학회, 정보과학회지 제20권 제3호,
		pp. 57 ~ 63, 2002년 3월.</li>
	<li>유상조, 홍성훈, 강성원, 홍경표, 예측 기반 동적 자원할당 구조를 이용한 실시간 VBR 비디오 트래픽의
		QoS제어 방법, 한국통신학회논문지, Vol. 27, No.1C, 2001.9.</li>
	<li>유지원, 김명철, 설순욱, 강성원, 이영희, 이 근구, 실험계획법을 이용한 TCP 데이터 부분에 대한
		상호운용성 시험스위트 생성, 정보과학회 논문지: 정보통신, 제 28권 제 2호, 2001년 6월.</li>
</ul>